<a href="https://colab.research.google.com/github/zeyad360/master_itm/blob/main/P11_pandas_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Working with Pandas 1

 - Create dataframe from lists, dictionaries
 - Read from file
 - Working with columns
 - Transformations and dates

Import __Pandas__.

In [ ]:
import pandas as pd  # pd is the standard abbreviation

Moving from a list dictionary to a Pandas dataframe (df)

In [ ]:
cus = {'name': ['Jorge', 'Luis', 'Pilar', 'Ana'],
            'age': [33, 25, 44, 27],
            'city': ['Valladolid', 'Madrid', 'Madrid', 'Cuenca']
            }
type(cus)

dict

In [ ]:
cus = {'name': ['Jorge', 'Luis', 'Pilar', 'Ana'],
            'age': [33, 25, 44, 27],
            'city': ['Valladolid', 'Madrid', 'Madrid', 'Cuenca']
            }

df_cus = pd.DataFrame(cus)
# El df toma como nombres de las columnas los campos del diccionario
print(type(df_cus))
df_cus

<class 'pandas.core.frame.DataFrame'>

    name  age        city
0  Jorge   33  Valladolid
1   Luis   25      Madrid
2  Pilar   44      Madrid
3    Ana   27      Cuenca

Info about of the df

In [ ]:
print(df_cus.shape)
print(df_cus.dtypes)

(4, 3)
name    object
age      int64
city    object
dtype: object

Create a dataframe by starting from a list and specifying the name of the columns.

In [ ]:
l_cus = [['Jorge', 33, 'Valladolid'],
              ['Luis', 25, 'Madrid'],
              ['Pilar', 44, 'Zaragoza'],
              ['Ana', 37, 'Cuenca']]

#df_cus = pd.DataFrame(l_cus)

df_cus = pd.DataFrame(l_cus,
   columns=['name', 'age', 'city'])
df_cus

    name  age        city
0  Jorge   33  Valladolid
1   Luis   25      Madrid
2  Pilar   44    Zaragoza
3    Ana   37      Cuenca

Creating a dataframe from a list of dictionaries

In [ ]:
lis_dic = [
        {'city': 'Madrid', 'sales': 100, 'center': 'C1', 'year': 2019},
        {'city': 'Valencia', 'sales': 100, 'year': 2019},
        {'city': 'Murcia', 'sales': 100, 'center': 'C6', 'year': 2019},
        { 'sales': 100, 'center': 'C6', 'year': 2019, 'nueva': 50}
        ]

df = pd.DataFrame(lis_dic)
df

       city  sales center  year  nueva
0    Madrid    100     C1  2019    NaN
1  Valencia    100    NaN  2019    NaN
2    Murcia    100     C6  2019    NaN
3       NaN    100     C6  2019   50.0

Iterate a DataFrame with a loop

In [ ]:
df

       city  sales center  year  nueva
0    Madrid    100     C1  2019    NaN
1  Valencia    100    NaN  2019    NaN
2    Murcia    100     C6  2019    NaN
3       NaN    100     C6  2019   50.0

Object series of Pandas

In [ ]:
serie_hist = pd.Series(index=['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun'] ,
                                            data =[33,51,48,38,57,63])
serie_hist

Jan    33
Feb    51
Mar    48
Apr    38
May    57
Jun    63
dtype: int64

In [ ]:
serie_hist['Jan']

33

In [ ]:
serie_hist[(serie_hist > 50)]

Feb    51
May    57
Jun    63
dtype: int64

Create a DataFrame from series object

In [ ]:
customer = {'edad' : pd.Series(index=['c1', 'c2', 'c3'] , data =[33,31,28]),
            'consumo' : pd.Series(index=['c1', 'c2', 'c3'] , data =[100,141,200])}
df_cus = pd.DataFrame(customer)
df_cus

    edad  consumo
c1    33      100
c2    31      141
c3    28      200

Read DataFrame from file

In [17]:
df_sales = pd.read_csv("files\\f_sales1.csv",
                 sep=';', header='infer')
df_sales.head(10)

FileNotFoundError: [Errno 2] No such file or directory: 'files\\f_sales1.csv'

In [16]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [10]:
# se puede especificar ruta completa
#df_sales = pd.read_csv("C:\\.........\\ficheros\\f_sales1.txt",    sep=';', header='infer')
df_sales.head(10)

NameError: name 'df_sales' is not defined

In [ ]:
!dir

sample_data

In [11]:
df_sales = pd.read_csv("files\\f_sales1.csv",
                 sep=';', header='infer')
df_sales.head(10)

FileNotFoundError: [Errno 2] No such file or directory: 'files\\f_sales1.csv'

In [ ]:
# If the file folder were at the same level as the path of the script
# we use '..'' and then the name of the folder where it is located
#df_sales = pd.read_csv("..\\files\\f_sales1.csv",                 sep=';', header='infer')
df_sales.head(10)

    oficina     vendedor producto  unidades
0    Madrid  m_vendedor1       P1        20
1    Madrid  m_vendedor1       P2        19
2    Madrid  m_vendedor1       P3         8
3    Madrid  m_vendedor1       P4         5
4    Madrid  m_vendedor1       P5        18
5    Madrid  m_vendedor4      P14         1
6    Madrid  m_vendedor4      P15         7
7  Valencia  v_vendedor1      P10         1
8  Valencia  v_vendedor1      P11         2
9  Valencia  v_vendedor1      P12         0

In [ ]:
df_sales.dtypes

office         object
salesperson    object
product        object
units           int64
dtype: object

You can specify the types on read. This reduces time reading on large files

In [ ]:
types = {'office': 'str', 'salesperson': 'str', 'product': 'str', 'units': 'int'}
df_sales = pd.read_csv("files\\f_sales1.csv",
                 sep=';', header='infer', dtype=types)
df_sales.head(10)

     office salesperson product  units
0    Madrid       m_sp1      P1     20
1    Madrid       m_sp1      P2     19
2    Madrid       m_sp1      P3      8
3    Madrid       m_sp1      P4      5
4    Madrid       m_sp1      P5     18
5    Madrid       m_sp4     P14      1
6    Madrid       m_sp4     P15      7
7  Valencia       v_sp1     P10      1
8  Valencia       v_sp1     P11      2
9  Valencia       v_sp1     P12      0

In [ ]:
df_sales.dtypes

office         object
salesperson    object
product        object
units           int32
dtype: object

__Number__ of __rows__

In [ ]:
df_sales.count()

oficina     34
vendedor    34
producto    34
unidades    34
dtype: int64

Get a __sample__ of df

In [ ]:
df_sales.sample(2)

      office salesperson product  units
28    Lisboa       l_sp1     P20      6
15  Valencia       v_sp1     P18     10

Another way of reading by handling the path and filename with variables

In [ ]:
filepath = "files\\"
filename = "f_sales1.txt"
df_sales = pd.read_csv(filepath+filename, sep=';', header='infer')
df_sales.head(10)

     office salesperson product  units
0    Madrid       m_sp1      P1     20
1    Madrid       m_sp1      P2     19
2    Madrid       m_sp1      P3      8
3    Madrid       m_sp1      P4      5
4    Madrid       m_sp1      P5     18
5    Madrid       m_sp4     P14      1
6    Madrid       m_sp4     P15      7
7  Valencia       v_sp1     P10      1
8  Valencia       v_sp1     P11      2
9  Valencia       v_sp1     P12      0

Working with decimals in file reading

In [ ]:
# In this file the decimal separator is .
df_sal = pd.read_csv("files\\f_sales_dec1.txt",
                 sep=';', header='infer')
df_sal.head(10)

     office  salesperson product  sales_amount
0    Madrid  m_vendedor1      P1         20.30
1    Madrid  m_vendedor1      P2         19.10
2    Madrid  m_vendedor1      P3          8.30
3    Madrid  m_vendedor1      P4          5.30
4    Madrid  m_vendedor1      P5         18.34
5    Madrid  m_vendedor4     P14          1.04
6    Madrid  m_vendedor4     P15          7.03
7  Valencia  v_vendedor1     P10         10.30
8  Valencia  v_vendedor1     P11         20.50
9  Valencia  v_vendedor1     P12          8.60

In [ ]:
df_sal.dtypes

office           object
salesperson      object
product          object
sales_amount    float64
dtype: object

In [ ]:
# In this file the decimal separator is , This must be specified as a read option
df_sal = pd.read_csv("files\\f_sales_dec2.txt",
                 sep=';', header='infer', decimal=",")
df_sal.head(10)

     office  salesperson product  sales_amount
0    Madrid  m_vendedor1      P1         20.30
1    Madrid  m_vendedor1      P2         19.10
2    Madrid  m_vendedor1      P3          8.30
3    Madrid  m_vendedor1      P4          5.30
4    Madrid  m_vendedor1      P5         18.34
5    Madrid  m_vendedor4     P14          1.04
6    Madrid  m_vendedor4     P15          7.03
7  Valencia  v_vendedor1     P10         10.30
8  Valencia  v_vendedor1     P11         20.50
9  Valencia  v_vendedor1     P12          8.60

In [ ]:
df_sal.dtypes

oficina      object
vendedor     object
producto     object
ventas      float64
dtype: object

Reading from Excel file

In [ ]:
df_sales1 = pd.read_excel("files\\f_sales1.xlsx")
df_sales1.head(10)

     office salesperson product  units
0    Madrid       m_sp1      P1     20
1    Madrid       m_sp1      P2     19
2    Madrid       m_sp1      P3      8
3    Madrid       m_sp1      P4      5
4    Madrid       m_sp1      P5     18
5    Madrid       m_sp4     P14      1
6    Madrid       m_sp4     P15      7
7  Valencia       v_sp1     P10      1
8  Valencia       v_sp1     P11      2
9  Valencia       v_sp1     P12      0

### Working with columns

Access a column

In [ ]:
# acceder a una columna:
print(df_cus['name'])
print(df_cus.name)

0    Jorge
1     Luis
2    Pilar
3      Ana
Name: name, dtype: object
0    Jorge
1     Luis
2    Pilar
3      Ana
Name: name, dtype: object

Accessing a row

In [ ]:
df_cus['name'][0]

'Jorge'

Iterate a df with a loop

In [ ]:
nrows = len(df_cus)
for i in range(nrows):
    print(df_cus['name'][i])

Jorge
Luis
Pilar
Ana

__Ass__ new columns

In [ ]:
df_cus['city'] = "Lugo"
df_cus['city'] = ["Lugo","Murcia","León", "Soria"]
df_cus

  nombre  edad  ciudad
0  Jorge    33    Lugo
1   Luis    25  Murcia
2  Pilar    44    León
3    Ana    37   Soria

In [ ]:
df_cus['revenue'] = [40,30,35,28]
df_cus['costs'] = [10,8,11,9]
df_cus['margin'] = df_cus['revenue'] - df_cus['costs']
df_cus['dt'] = '31012024'
df_cus['year'] = df_cus['dt'].str[-4:]
df_cus

    name  age        city  revenue  costs  margin        dt  year
0  Jorge   33  Valladolid       40     10      30  31012024  2024
1   Luis   25      Madrid       30      8      22  31012024  2024
2  Pilar   44    Zaragoza       35     11      24  31012024  2024
3    Ana   37      Cuenca       28      9      19  31012024  2024

In [ ]:
df_cus.dtypes

name       object
age         int64
city       object
revenue     int64
costs       int64
margin      int64
dt         object
year       object
dtype: object

Operations with dates

In [ ]:
df_cus['dt'] = pd.to_datetime(df_cus['dt'], format="%d%m%Y") # paso de string a datetime
df_cus.dtypes

name               object
age                 int64
city               object
revenue             int64
costs               int64
margin              int64
dt         datetime64[ns]
year               object
dtype: object

If the format were 'yyyy-mm-dd' it could be transformed with the médtodo astype

In [ ]:
df_cus['dt_d'] = '2024-02-15'
df_cus['dt_d'] = df_cus['dt_d'].astype('datetime64[ns]') # only valid in format 'yyyy-mm-dd'.
df_cus

    name  age        city  revenue  costs  margin         dt  year       dt_d
0  Jorge   33  Valladolid       40     10      30 2024-01-31  2024 2024-02-15
1   Luis   25      Madrid       30      8      22 2024-01-31  2024 2024-02-15
2  Pilar   44    Zaragoza       35     11      24 2024-01-31  2024 2024-02-15
3    Ana   37      Cuenca       28      9      19 2024-01-31  2024 2024-02-15

In [ ]:
df_cus['dt'] = pd.to_datetime(df_cus['dt'], format="%d%m%Y") # string to datetime
df_cus['dt2'] = df_cus['dt'].dt.strftime('%d/%m/%y') # datetime to string
df_cus

,name,age,city,revenue,costs,margin,dt,year,dt_d,dt2
0,Jorge,33,Valladolid,40,10,30,2024-01-31,2024,2024-02-15,31/01/24
1,Luis,25,Madrid,30,8,22,2024-01-31,2024,2024-02-15,31/01/24
2,Pilar,44,Zaragoza,35,11,24,2024-01-31,2024,2024-02-15,31/01/24
3,Ana,37,Cuenca,28,9,19,2024-01-31,2024,2024-02-15,31/01/24

In [ ]:
df_cus['age_s1'] = df_cus['age'].astype('str')

In [ ]:
df_cus, df_cus.dtypes

(  nombre  edad  ciudad  ingresos  costes  margen        fec   año      fec_d  \
 0  Jorge    33    Lugo        40      10      30 2019-01-31  2019 2020-02-15
 1   Luis    25  Murcia        30       8      22 2019-01-31  2019 2020-02-15
 2  Pilar    44    León        35      11      24 2019-01-31  2019 2020-02-15
 3    Ana    37   Soria        28       9      19 2019-01-31  2019 2020-02-15

        fec2 edad_s1
 0  31/01/19      33
 1  31/01/19      25
 2  31/01/19      44
 3  31/01/19      37  ,
 nombre              object
 edad                 int64
 ciudad              object
 ingresos             int64
 costes               int64
 margen               int64
 fec         datetime64[ns]
 año                 object
 fec_d       datetime64[ns]
 fec2                object
 edad_s1             object
 dtype: object)

__Eliminar__ columna

Para acceder a métodos propios de string o datetime añadir .str o .dt

In [ ]:
df_cus['año'] = df_cus['fec'].dt.year
df_cus['name'] = df_cus['name'].str.upper()
df_cus['lon_name'] = df_cus['name'].str.len()
df_cus['inicial'] = df_cus['name'].str[0:1]
#df_cus['fec'].dt.month
#df_cus['fec'].dt.day
df_cus

,nombre,edad,ciudad,ingresos,costes,margen,fec,año,fec_d,fec2,edad_s1,lon_nombre,inicial
0,JORGE,33,Lugo,40,10,30,2019-01-31,2019,2020-02-15,31/01/19,33,5,J
1,LUIS,25,Murcia,30,8,22,2019-01-31,2019,2020-02-15,31/01/19,25,4,L
2,PILAR,44,León,35,11,24,2019-01-31,2019,2020-02-15,31/01/19,44,5,P
3,ANA,37,Soria,28,9,19,2019-01-31,2019,2020-02-15,31/01/19,37,3,A

In [ ]:
#eliminar columna
del df_cus['año']
#df_cus = df_cus.drop('año', 1)
df_cus

,nombre,edad,ciudad,ingresos,costes,margen,fec,fec_d,fec2,edad_s1,lon_nombre,inicial
0,JORGE,33,Lugo,40,10,30,2019-01-31,2020-02-15,31/01/19,33,5,J
1,LUIS,25,Murcia,30,8,22,2019-01-31,2020-02-15,31/01/19,25,4,L
2,PILAR,44,León,35,11,24,2019-01-31,2020-02-15,31/01/19,44,5,P
3,ANA,37,Soria,28,9,19,2019-01-31,2020-02-15,31/01/19,37,3,A

Data type conversion

In [ ]:
df_cus.dtypes

name               object
age                 int64
city               object
revenue             int64
costs               int64
margin              int64
dt         datetime64[ns]
year               object
dt_d       datetime64[ns]
dt2                object
dtype: object

In [ ]:
df_cus['age_s']=df_cus['age'].astype('str')
df_cus.dtypes

name               object
age                 int64
city               object
revenue             int64
costs               int64
margin              int64
dt         datetime64[ns]
year               object
dt_d       datetime64[ns]
dt2                object
age_s              object
dtype: object

Apply __transformations__ in pandas with __functions__.

In [ ]:
# Apply function to apply transformations calling to functions
def level(val):
    if val <= 10:
        level='low'
    elif val > 10 and val <= 25:
        level = 'medium'
    else:
        level='high'
    return(level)

df_cus['rango_margin']=df_cus['margin'].apply(level)

In [ ]:
df_cus

,name,age,city,revenue,costs,margin,dt,year,dt_d,dt2,age_s,rango_margin
0,Jorge,33,Valladolid,40,10,30,2024-01-31,2024,2024-02-15,31/01/24,33,high
1,Luis,25,Madrid,30,8,22,2024-01-31,2024,2024-02-15,31/01/24,25,medium
2,Pilar,44,Zaragoza,35,11,24,2024-01-31,2024,2024-02-15,31/01/24,44,medium
3,Ana,37,Cuenca,28,9,19,2024-01-31,2024,2024-02-15,31/01/24,37,medium

Same operations, but with Lambda function

In [ ]:
f = lambda x : 'high' if x >= 25 else 'low'

df_cus['rango_margin']=df_cus['margin'].apply(f)
df_cus['rango_margin3']=df_cus['margin'].apply(lambda x: 'high' if x >= 25 else 'low' )

In [ ]:
df_cus

,name,age,city,revenue,costs,margin,dt,year,dt_d,dt2,age_s,rango_margin,rango_margin3
0,Jorge,33,Valladolid,40,10,30,2024-01-31,2024,2024-02-15,31/01/24,33,high,high
1,Luis,25,Madrid,30,8,22,2024-01-31,2024,2024-02-15,31/01/24,25,low,low
2,Pilar,44,Zaragoza,35,11,24,2024-01-31,2024,2024-02-15,31/01/24,44,low,low
3,Ana,37,Cuenca,28,9,19,2024-01-31,2024,2024-02-15,31/01/24,37,low,low

It can also be done with __map__ ( apply acts at row level and map at column level and is better in terms of performance).

In [ ]:
df_cus['rango_margin4']=df_cus['margin'].map(f)
df_cus

,name,age,city,revenue,costs,margin,dt,year,dt_d,dt2,age_s,rango_margin,rango_margin3,rango_margin4
0,Jorge,33,Valladolid,40,10,30,2024-01-31,2024,2024-02-15,31/01/24,33,high,high,high
1,Luis,25,Madrid,30,8,22,2024-01-31,2024,2024-02-15,31/01/24,25,low,low,low
2,Pilar,44,Zaragoza,35,11,24,2024-01-31,2024,2024-02-15,31/01/24,44,low,low,low
3,Ana,37,Cuenca,28,9,19,2024-01-31,2024,2024-02-15,31/01/24,37,low,low,low

In [ ]:
df_cus

,name,age,city,revenue,costs,margin,dt,year,dt_d,dt2,age_s,rango_margin,rango_margin3,rango_margin4
0,Jorge,33,Valladolid,40,10,30,2024-01-31,2024,2024-02-15,31/01/24,33,high,high,high
1,Luis,25,Madrid,30,8,22,2024-01-31,2024,2024-02-15,31/01/24,25,low,low,low
2,Pilar,44,Zaragoza,35,11,24,2024-01-31,2024,2024-02-15,31/01/24,44,low,low,low
3,Ana,37,Cuenca,28,9,19,2024-01-31,2024,2024-02-15,31/01/24,37,low,low,low

Apply method with multiple columns

In [ ]:
def calc_margin(rev, cos):
    return rev-cos

In [ ]:
df_cus['margin2'] = df_cus.apply(lambda x: calc_margin(x['revenue'], x['costs']) , axis=1)
df_cus

,name,age,city,revenue,costs,margin,dt,year,dt_d,dt2,age_s,rango_margin,rango_margin3,rango_margin4,margin2
0,Jorge,33,Valladolid,40,10,30,2024-01-31,2024,2024-02-15,31/01/24,33,high,high,high,30
1,Luis,25,Madrid,30,8,22,2024-01-31,2024,2024-02-15,31/01/24,25,low,low,low,22
2,Pilar,44,Zaragoza,35,11,24,2024-01-31,2024,2024-02-15,31/01/24,44,low,low,low,24
3,Ana,37,Cuenca,28,9,19,2024-01-31,2024,2024-02-15,31/01/24,37,low,low,low,19

Fields calculated with assign method

In [ ]:
df_cus = df_cus.assign(months_age=df_cus['age'] * 12)
df_cus

,name,age,city,revenue,costs,margin,dt,year,dt_d,dt2,age_s,rango_margin,rango_margin3,rango_margin4,margin2,months_age
0,Jorge,33,Valladolid,40,10,30,2024-01-31,2024,2024-02-15,31/01/24,33,high,high,high,30,396
1,Luis,25,Madrid,30,8,22,2024-01-31,2024,2024-02-15,31/01/24,25,low,low,low,22,300
2,Pilar,44,Zaragoza,35,11,24,2024-01-31,2024,2024-02-15,31/01/24,44,low,low,low,24,528
3,Ana,37,Cuenca,28,9,19,2024-01-31,2024,2024-02-15,31/01/24,37,low,low,low,19,444

Vectorised vs. loop operations. Vectorised operations are much more optimal

In [ ]:
df_sales_p = df_sales.copy()
df_sales_p['price'] = 5

In [ ]:
df_sales_p.head(10)

     office salesperson product  units  price
0    Madrid       m_sp1      P1     20      5
1    Madrid       m_sp1      P2     19      5
2    Madrid       m_sp1      P3      8      5
3    Madrid       m_sp1      P4      5      5
4    Madrid       m_sp1      P5     18      5
5    Madrid       m_sp4     P14      1      5
6    Madrid       m_sp4     P15      7      5
7  Valencia       v_sp1     P10      1      5
8  Valencia       v_sp1     P11      2      5
9  Valencia       v_sp1     P12      0      5

Loop operation

In [ ]:
#Accedemos por posición
df_sales_p.at[0, 'units']

In [ ]:
%%timeit
for i, row in df_sales_p.iterrows():
    df_sales_p.at[i,'sales'] = row['units']*row['price']

2.85 ms ± 163 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

Operation __vectorised__

In [ ]:
%%timeit
df_sales_p['sales'] = df_sales_p['units']*df_sales_p['price']

199 µs ± 12.8 µs per loop (mean ± std. dev. of 7 runs, 10,000 loops each)

In [ ]:
df_sales_p.head()

   office salesperson product  units  price  sales
0  Madrid       m_sp1      P1     20      5    100
1  Madrid       m_sp1      P2     19      5     95
2  Madrid       m_sp1      P3      8      5     40
3  Madrid       m_sp1      P4      5      5     25
4  Madrid       m_sp1      P5     18      5     90

Access all columns of a dataframe

In [ ]:
# loop
print(type(df_cus.columns))
for col in df_cus.columns:
    print(col)

<class 'pandas.core.indexes.base.Index'>
name
age
city
revenue
costs
margin
dt
year
dt_d
dt2
age_s
rango_margin
rango_margin3
rango_margin4
margin2
months_age

In [ ]:
df_cus.columns

Index(['name', 'age', 'city', 'revenue', 'costs', 'margin', 'dt', 'year',
       'dt_d', 'dt2', 'age_s', 'rango_margin', 'rango_margin3',
       'rango_margin4', 'margin2', 'months_age'],
      dtype='object')